<!-- placeholder-1 -->
```fish
tofu plan -chdir=opentofu
```
<!-- placeholder-2 -->

<details><summary>Diff of 5 changes.</summary>

```diff
+ google_artifact_registry_repository.linkedin_genai_gcr will be created
+ google_cloud_run_v2_service.linkedin_genai_service will be created
+ google_project.linkedin_genai will be created
+ google_service_account.linkedin_genai_service will be created
+ google_storage_bucket.linkedin_genai_bucket will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 5 to add, 0 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @rdhar at 2025-03-15T16:50:34Z [(view log)](https://github.com/Ishangoai/linkedin_genai/actions/runs/13874806018/job/38825759467#step:5:1).
</summary>

```hcl

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # google_artifact_registry_repository.linkedin_genai_gcr will be created
  + resource "google_artifact_registry_repository" "linkedin_genai_gcr" {
      + cleanup_policy_dry_run = true
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "europe-west2"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "linkedin-genai"
      + repository_id          = "linkedin-genai-gcr"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + vulnerability_scanning_config (known after apply)
    }

  # google_cloud_run_v2_service.linkedin_genai_service will be created
  + resource "google_cloud_run_v2_service" "linkedin_genai_service" {
      + client                  = "gcloud"
      + client_version          = "511.0.0"
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = true
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = "GA"
      + location                = "europe-west2"
      + name                    = "linkedin-genai-service"
      + observed_generation     = (known after apply)
      + project                 = "linkedin-genai"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + max_instance_request_concurrency = 80
          + service_account                  = "linkedin-genai-service@linkedin-genai.iam.gserviceaccount.com"
          + timeout                          = "300s"

          + containers {
              + build_info = (known after apply)
              + image      = "europe-west2-docker.pkg.dev/linkedin-genai/linkedin-genai-gcr/linkedin-genai-image:7dc035f1e064c22eb6e9fa34ef5b12463cfadf15"
              + name       = "linkedin-genai-image-1"

              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }

              + ports {
                  + container_port = 8080
                  + name           = "http1"
                }

              + resources {
                  + cpu_idle          = true
                  + limits            = {
                      + "cpu"    = "1000m"
                      + "memory" = "512Mi"
                    }
                  + startup_cpu_boost = true
                }

              + startup_probe {
                  + failure_threshold     = 1
                  + initial_delay_seconds = 0
                  + period_seconds        = 240
                  + timeout_seconds       = 240

                  + tcp_socket {
                      + port = 8080
                    }
                }
            }

          + scaling {
              + max_instance_count = 10
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # google_project.linkedin_genai will be created
  + resource "google_project" "linkedin_genai" {
      + auto_create_network = true
      + billing_account     = "01AC44-DF4B27-C9AF71"
      + deletion_policy     = "PREVENT"
      + effective_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                  = (known after apply)
      + name                = "Linkedin GenAI"
      + number              = (known after apply)
      + org_id              = "93046436925"
      + project_id          = "linkedin-genai"
      + terraform_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
    }

  # google_service_account.linkedin_genai_service will be created
  + resource "google_service_account" "linkedin_genai_service" {
      + account_id   = "linkedin-genai-service"
      + disabled     = false
      + display_name = "linkedin-genai-service"
      + email        = "linkedin-genai-service@linkedin-genai.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:linkedin-genai-service@linkedin-genai.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "linkedin-genai"
      + unique_id    = (known after apply)
    }

  # google_storage_bucket.linkedin_genai_bucket will be created
  + resource "google_storage_bucket" "linkedin_genai_bucket" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EUROPE-WEST2"
      + name                        = "linkedin_genai_bucket"
      + project                     = "linkedin-genai"
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- tofu-24-d5c639024c1e384af1beeb95f4e5fd73.tfplan -->
<!-- placeholder-6 -->